Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/educational_supports/early_school_leavers_programmes.html.txt.tmx
Source language: en
Languages: ga

source: The legal definition of early school leaving refers to non-participation in school before reaching the age of 16 years or before completing 3 years post-primary education, whichever is later
ga: Déanann an sainmhíniú dlíthiúil ar luathfhágáil scoile tagairt do neamh-rannpháirtíocht sa scoil sula sroichtear 16 bliana d'aois nó sula gcomhlánaítear 3 bliana d'oideachas iarbhunscoile - cibé acu is déanaí

source: A more specific definition of early school leavers is those who leave the education system without a minimum of 5 passes in the Leaving Certificate or equivalent qualification
ga: Sainmhíniú níos sonraí do luathfhágálaithe scoile ná daoine a fhágann an córas oideachais gan íosmhéid de 5 phas acu san Ardteistiméireacht nó cáilíocht atá ar comhchéim

source: Young people who leave education without recognised qualifications are at a disadvantage in the labour market and are at increased risk of poverty and social exclusion
ga: Tá míbhuntáiste sa mhargadh saothair ag daoine óga a fhágann oideachas gan cháilíochtaí aitheanta agus tá siad i mbaol níos mó maidir le bochtaineacht agus eisiamh sóisialta

source: For those people who have already left school and would like to further their education and training, there are a number of schemes in place
ga: Tá roinnt scéimeanna curtha i bhfeidhm do dhaoine a bhfuil an scoil fágtha acu cheana féin, agus gur mhaith leo feabhas a chur ar a gcuid oideachais agus oiliúna

source: These are non-formal education facilities that aim to provide high quality, relevant and efficient education and training opportunities outside the mainstream education setting
ga: Is saoráidí oideachais neamhfhoirmiúla iad seo a dhíríonn ar dheiseanna oideachais agus oiliúna ardchaighdeáin, ábhartha agus éifeachtach a sholáthar lasmuigh den suíomh oideachais phríomhshrutha

source: The School Completion Programme aims to increase the number of young people staying in primary and second-level schools
ga: Clár den Roinn Oideachais agus Scileanna é an Clár Críochnaithe Scoile ag a bhfuil sé de chuspóir an líon ógánach a fhanann i mbunscoileanna agus i meánscoileanna a mhéadú

source: The programme is a support strand within the Child and Family Agency under the Department of Children and Youth Affairs
ga: Snáithe thacaíochta atá sa chlár laistigh den Bhord Náisiúnta um Leas Oideachais faoin Roinn Leanaí agus Gnóthaí Óige

source: It forms part of the Department of Education and Skills social inclusion strategy Delivering Equality of Opportunity in Schools (DEIS) to help children and young people who are at risk of or who are experiencing educational disadvantage
ga: Cruthaíonn sé cuid de straitéis cuimsithe shóisialta na Roinne Oideachais agus Scileanna, Comhionannas Deiseanna i Scoileanna a Sheachadadh (DEIS) chun cabhrú le leanaí atá i mbaol nó atá faoi bhuntáiste oideachais

source: Each project is managed by a local management committee and provides a tailored programme of in-school, after school and holiday time interventions to targeted children and young people who are at risk of early school leaving
ga: Déanann coiste bainistíochta áitiúil gach tionscadal a bhainistiú agus cuireann siad clár saincheaptha idirghabhála le linn am scoile, i ndiaidh am scoile agus le linn am saoire ar fáil do leanaí agus d’ógánaigh sprioctha atá i mbaol an scoil a fhágáil go luath

source: Back to Education Initiative
ga: An Tionscnamh um Fhilleadh ar Oideachas

source: The Back to Education Initiative provides opportunities for second chance education to adult learners and early school leavers who want to upgrade their skills
ga: Soláthraíonn an Tionscnamh um Fhilleadh ar Oideachas deiseanna d'oideachas athdheise d'fhoghlaimeoirí aosacha agus do dhaoine a d'fhág an scoil go luath ar mian leo a gcuid scileanna a nuashonrú

source: The initiative builds on existing schemes such as Youthreach and Vocational Training Opportunities Scheme (VTOS) - see below
ga: Tógann an tionscnamh seo ar scéimeanna reatha cosúil le Ógtheagmháil agus an Scéim Deiseanna Oiliúna Gairmoideachais (SDOG) - féach thíos

source: It also includes adult literacy schemes, community education and Post Leaving Certificate (PLC) courses
ga: Áirítear na nithe a leanas ann chomh maith: scéimeanna litearthachta d'aosaigh, oideachas pobail agus cúrsaí iar-Ardteistiméireachta (PLC)

source: Youthreach is a joint programme between the Department of Education and Skills and the Department of Jobs, Enterprise and Innovation
ga: Is clár é Ógtheagmháil atá reáchtáilte i gcomhar leis an Roinn Oideachais agus Scileanna agus an Roinn Post, Fiontar agus Nuálaíochta

source: It is intended to help young people return to learning and prepare for employment and adult life
ga: Tá sé beartaithe chun cabhrú le daoine óga filleadh ar fhoghlaim agus ullmhú don saol fostaíochta agus aosach

source: It also provides them with opportunities to get certified qualifications
ga: Soláthraíonn sé deiseanna dóibh chomh maith le cáilíochtaí deimhnithe a fháil

source: The programme is aimed at unemployed early school leavers aged 15 to 20
ga: Tá an clár dírithe ar luathfhágálaithe scoile atá dífhostaithe idir 15 agus 20 bliana d'aois

source: The Youthreach programme is delivered through Youthreach centres and Community Training Centres
ga: Déantar seachadadh ar an gclár Ógtheagmhála trí ionaid Ógtheagmhála agus Ionaid Oiliúna Pobail

source: Vocational Training Opportunities Scheme
ga: Scéim Deiseanna Oiliúna Gairmoideachais

source: The Vocational Training Opportunities Scheme (VTOS) is a special range of courses designed to meet the education needs of unemployed people
ga: Is raon de chúrsaí speisialta í an Scéim Deiseanna Oiliúna Gairmoideachais (SDOG) atá deartha chun freastal ar riachtanais oideachais dhaoine dífhostaithe

source: The scheme aims to give them a choice of options from basic education and training to advanced vocational preparation and training
ga: Díríonn an scéim ar rogha roghanna a thabhairt dóibh idir oideachas agus oiliúint bhunúsach go ardoiliúint agus ardullmhúchán gairme

source: It targets people over the age of 21 who have been getting unemployment payments or signing for credits for at least 6 months
ga: Díríonn sé ar dhaoine os cionn 21 a bhí ag fáil íocaíochtaí dífhostaíochta nó ag síniú do chreidmheasanna ar feadh 6 mhí ar a laghad

source: It is delivered through the Education and Training Boards (ETBs) at centres all over Ireland - see 'Where to apply' below
ga: Déantar seachadadh ar an gclár trí choistí gairmoideachais (VEC) in ionaid mórthimpeall na hÉireann - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Department of Justice workshop programme
ga: Clár ceardlainne na Roinne Dlí agus Cirt

source: The Department of Justice runs employment placement, education and training services for offenders where they can train to develop work-related skills
ga: Déanann an Roinn Dlí agus Cirt socrúchán fostaíochta a reáchtáil, seirbhísí oideachais agus oiliúna do chiontóirí inar féidir leo oiliúint a fháil chun scileanna a fhorbairt maidir le cúrsaí oibre

source: Many of the available training opportunities carry accreditation or certification for people who complete the required course to the approved standard
ga: Bíonn creidiúnú nó teastasú ag baint le mórán deiseanna oiliúna atá ar fáil, a dhéanann an cúrsa riachtanach a chomhlánú go caighdeán faofa

source: Many of the early school leavers programmes have age limits and are targeted at young people who may need help improving their future employment prospects
ga: Tá aoisteorainneacha ag baint le formhór de na cláir luathfhágála scoile agus tá siad dírithe ar dhaoine óga a bhféadfadh cabhair a bheith de dhíth orthu lena gcuid féidearthachtaí fostaíochta sa todhchaí a fheabhsú

source: For more details about the entry requirements, you should contact the individual programmes – see ‘Where to apply’ below
ga: Chun tuilleadh sonraí a fháil faoi riachtanais iontrála, ba chóir duit teagmháil a dhéanamh leis na cláir aonair - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Youthreach: Contact your local Youthreach centre or Community Training Centre
ga: Ógtheagmháil: Déan teagmháil le ionad Ógtheagmhála nó Ionad Oilúna Pobail na háite

source: Contact your local ETB for details of adult literacy, adult education programmes and VTOS
ga: Déan teagmháil le do BOO áitiúil chun eolas a fháil faoi litearthacht d'aosaigh, cláir oideachais d'aosaigh agus SDOG

source: For information about the Department of Justice workshops contact the Probation Service
ga: Déan teagmháil le do Sheirbhís Phromhaidh chun eolas a fháil faoi chlár ceardlainne na Roinne Dlí agus Cirt

source: Education and Training Boards
ga: Boird Oideachais agus Oiliúna

source: Since 1 July 2013, Education and Training Boards (ETBs) replaced Vocational Educational Committees (VECs)
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna (BOO) in áit coistí gairmoideachais

source: All services provided by VECs will continue to be provided by ETBs
ga: Leanfaidh na BOO an uile sheirbhíse soláthartha ag na coistí gairmoideachais a sholáthar

source: FÁS training centres are also being transferred to ETBs
ga: Aistrítear ionaid oiliúna FÁS chuig BOO freisin
